// 1.Логічні порівняння та alert:

// Створіть змінні number1 та number2 і використайте оператори порівняння, щоб визначити, чи вони рівні.
// Виведіть результат за допомогою alert, щоб повідомити користувача про те, чи рівні числа.
let number1=10;
let number2=20;
if (number1===number2){alert("Числа рівні");}
else {alert("Числа не рівні");}

// 2.Метод вводу інформації та логічні порівняння:

// Використовуючи prompt, запросіть у користувача введення числа.
// Перевірте, чи введене число парне чи непарне.
// Виведіть результат з використанням console.log.
let userNumber = Number(prompt("Введіть число"));
if (userNumber % 2 === 0) {console.log("Число парне");}
else {console.log("Число непарне");}    

// 3. логічні порівняння та введення-виведення:

// Використовуючи prompt, запитайте у користувача його вік.
// Перевірте, чи вік менше 18 років.
// Виведіть відповідне повідомлення про те, чи може користувач використовувати певний ресурс.
let userAge = Number(prompt("Введіть ваш вік"));
if (userAge < 18) {console.log("Ви не можете використовувати цей ресурс");}
else {console.log("Ви можете використовувати цей ресурс");} 

// 4. Розрахунок вартості товару та console.log:

// Створіть змінну ціна та кількість товару і присвойте їм значення використовуючи prompt .
// Використовуйте математичні операції для обчислення вартості товару (ціна * кількість).
// Виведіть результат за допомогою console.log.
let price = Number(prompt("Введіть ціну товару"));
let quantity = Number(prompt("Введіть кількість товару"));
let totalCost = price * quantity;
console.log("Вартість товару:${totalCost} грн");
// 5. Розрахунок знижки на товар та alert:

// Використовуючи prompt, запросіть в користувача вартість товару.
// Розрахуйте знижку на товар у розмірі 50% від введеної вартості.
// Виведіть результат знижки за допомогою alert.
let produktPrice = Number(prompt("Введіть вартість товару"));
let discount = produktPrice * 0.5;
alert("Ваша знижка становить:  ${discount} грн");