// 1. Визначення типу геометричної фігури за допомогою switch:  Створіть код, який приймає назву геометричної фігури ("коло", "квадрат", "трикутник") і використовуючи switch оператор, виводить повідомлення про кількість сторін цієї фігури (наприклад, "Коло має 0коло", "Квадрат має 4 сторони").

let input = prompt('Введіть назву геометричної фігури (коло, квадрат, трикутник): або кількість сторін 0, 3, 4');
switch (input) {
    case 'коло':
        console.log('коло 0 сторін');
        break;
    
    case 'квадрат':
        console.log('квадрат 4 сторони');
        break;
    case 'трикутник':
        console.log('трикутник 3 сторони');   
        break;
    case '0':
        console.log('коло');
        break;  
    case '3':
        console.log('трикутник');
        break;  
    case '4':
        console.log('квадрат');
        break;
    default:
        console.log('Any information about ${input}');
        break;}

// 2. Підрахунок суми парних чисел: Створіть код, який використовує цикл while для знаходження суми всіх парних чисел в заданому діапазоні (наприклад, від 1 до 20).

let counter = 1;
let sum = 0;
while(counter <= 20){
    if(counter % 2 === 0){  
        sum += counter; 
    }   
    counter++;
}   
console.log('Sum of even numbers from 1 to 20 is ${sum}');
// let sum = 0;
// for (let i = 1; i <= 20; i++) {
//     if (i % 2 === 0) {
//         sum += i;
//     }   
// }
// console.log('Sum of even numbers from 1 to 20 is ${sum}');

// 3. Таблиця множення: Використовуючи цикл for, напишіть програму, яка генерує "таблицю множення" виводимо в console.log операції  для конкретного числа (наприклад, для числа 5).
const num = 5;
console.log('Таблиця множення для числа ${num}:');      
for (let i = 1; i <= 10; i++) {
    const result = num * i;
    console.log('${num} x ${i} = ${result}');
}   

// 4. Зворотний лічильник: Використовуючи цикл for, напишіть програму, яка виводить числа від 10 до 1 в зворотньому порядку.
for (let i = 10; i >= 1; i--) {
    console.log(i);
}   

// 5. Визначення чи є число парним чи непарним: Напишіть програму, яка приймає число і використовуючи if та for, виводить повідомлення про те, чи є число парним чи непарним.
prompt('Введіть число:');
const inputNumber = Number(prompt('Введіть число:'));   
if (Number.isNaN(inputNumber)) {
    console.log('Помилка: введено не число');
} else {
    for (let i = 0; i <= inputNumber; i++) {
        if (i % 2 === 0) {  
            console.log('${i} є парним числом');
        } else {
            console.log('${i} є непарним числом');
        }   
    }
}   

// 6. Знаходження першого парного числа:

// Напишіть програму, яка використовує цикл for для перебору чисел від 1 до 10 і виводить перше знайдене парне число. Використайте оператор break, щоб припинити виконання циклу, якщо парне число знайдено.
for (let i = 1; i <= 10; i++) {
    if (i % 2 === 0) {
        console.log('Перше парне число: ${i}');
        break;
    }   
}

// 7. Виведення парних чисел:
// Створіть програму, яка використовує цикл for для перебору чисел від 1 до 10 і виводить тільки парні числа. Використайте оператор continue, щоб пропустити ітерації для непарних чисел.
for (let i = 1; i <= 10; i++) {
    if (i % 2 !== 0) {
        continue; 
    }       
    console.log('Парне число: ${i}');
}